/*
*       该被ucos_ii.h包含，优先级和堆栈大小只能在该文件设置
*/

#ifndef  _APP_CFG_H_
#define  _APP_CFG_H_



/*
*********************************************************************************************************
*                                            任务优先级
*********************************************************************************************************
*/

#define  STARTUP_TASK_PRIO       2u	

#define  OS_TASK_TMR_PRIO                        (OS_LOWEST_PRIO - 2u)

#define  task1_prio              7u

#define  task2_prio              6u

#define  task3_prio              5u


/*
*********************************************************************************************************
*                                     任务栈大小（单位为 OS_STK ）
*********************************************************************************************************
*/

#define STARTUP_TASK_STK_SIZE   128u

#define task1_stk_size          128u

#define task2_stk_size          128u

#define task3_stk_size          128u






#endif  //_APP_CFG_H_
